DataProcessors/КонтрольИОтправкаАктовСверкиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>КонтрольИОтправкаАктовСверкиВзаиморасчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаФормированияСверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияФормированияСверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Акты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АктСверки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоСверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеСверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>800</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>999</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КлиентыБезАдреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РассылкаДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РассылкаДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРассылки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРассылокЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаСборкиЗаказовПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыРассылокЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыРассылокЭлектроннойПочты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛистНаФТП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроведениеКорректировкиСборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОЗадержкеПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверкиВзаиморасчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроблемыС_УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроведениеКорректировкиЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеЗаказаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольноеСообщение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/КонтрольИОтправкаАктовСверкиВзаиморасчетов/Ext/ObjectModule.bsl
Процедура ИнициализироватьПостроитель(НастройкиПостроителя = Неопределено) Экспорт 
	
	ПостроительОтчета = Новый ПостроительОтчета;
	
	Если НастройкиПостроителя = Неопределено Тогда
		НастройкиПостроителя = ПостроительОтчета.ПолучитьНастройки(Истина, Истина, Ложь, Ложь, Ложь);
	КонецЕсли; 
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	АктСверкиВзаиморасчетов.Контрагент,
	               |	АктСверкиВзаиморасчетов.ДоговорКонтрагента КАК Договор,
	               |	АктСверкиВзаиморасчетов.Ссылка КАК АктСверки,
	               |	АктСверкиВзаиморасчетов.ДатаНачала КАК НачалоСверки,
	               |	АктСверкиВзаиморасчетов.ДатаОкончания КАК ОкончаниеСверки,
	               |	АктСверкиВзаиморасчетов.Дата КАК ДатаДокумента,
	               |	Контрагенты.МенеджерМСК КАК Менеджер,
	               |	АктСверкиВзаиморасчетов.СверкаСогласована КАК Согласован,
	               |	АктСверкиВзаиморасчетов.Комментарий,
	               |	АктСверкиВзаиморасчетов.Номер,
	               |	АктСверкиВзаиморасчетов.Организация
	               |ПОМЕСТИТЬ АктыСверок
	               |ИЗ
	               |	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |		ПО АктСверкиВзаиморасчетов.Контрагент = Контрагенты.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ПО АктСверкиВзаиморасчетов.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	               |ГДЕ
	               |	НЕ АктСверкиВзаиморасчетов.ПометкаУдаления
	               |	И (НЕ ДоговорыКонтрагентов.НеОтправлятьАктыСверкиВзаиморасчетов
	               |			ИЛИ ДоговорыКонтрагентов.НеОтправлятьАктыСверкиВзаиморасчетов ЕСТЬ NULL )
	               |	И Контрагенты.Ссылка = Контрагенты.ГоловнойКонтрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АктыСверок.Контрагент,
	               |	АктыСверок.Договор,
	               |	АктыСверок.АктСверки,
	               |	АктыСверок.НачалоСверки,
	               |	АктыСверок.ОкончаниеСверки,
	               |	АктыСверок.ДатаДокумента,
	               |	АктыСверок.Менеджер,
	               |	АктыСверок.Согласован,
	               |	АктыСверок.Комментарий,
	               |	АктыСверок.Номер,
	               |	ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(999)) КАК АдресЭлектроннойПочты,
	               |	ВЫБОР
	               |		КОГДА РассылкаДокументовСрезПоследних.Период ЕСТЬ NULL 
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Отправлен,
	               |	ВЫБОР
	               |		КОГДА РассылкаДокументовСрезПоследних.Период ЕСТЬ NULL 
	               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |		ИНАЧЕ РассылкаДокументовСрезПоследних.ВремяОтправки
	               |	КОНЕЦ КАК ДатаОтправки,
	               |	АктыСверок.Организация
	               |ИЗ
	               |	АктыСверок КАК АктыСверок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПоследних(
	               |				,
	               |				(Документ, Контрагент) В
	               |						(ВЫБРАТЬ
	               |							АктыСверок.АктСверки,
	               |							АктыСверок.Контрагент
	               |						ИЗ
	               |							АктыСверок КАК АктыСверок)
	               |					И ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.АктСверкиВзаиморасчетов)) КАК РассылкаДокументовСрезПоследних
	               |		ПО АктыСверок.АктСверки = РассылкаДокументовСрезПоследних.Документ
	               |			И АктыСверок.Контрагент = РассылкаДокументовСрезПоследних.Контрагент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |		ПО АктыСверок.Контрагент = КонтактнаяИнформация.Объект
	               |			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	               |			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДляОтправкиАктовСверок))";
	   
	
	ПостроительОтчета.Текст = ТекстЗапроса;
	ПостроительОтчета.ЗаполнитьНастройки();
	
	ПостроительОтчета.УстановитьНастройки(НастройкиПостроителя);
	ПорядокПостроителя = ПостроительОтчета.Порядок;
	ПорядокПостроителя.Добавить("ДатаДокумента");
	
	ОтборПостроителя = ПостроительОтчета.Отбор; 
	
	ОтборПостроителя.Добавить("ДатаДокумента");
	ОтборПостроителя["ДатаДокумента"].Использование = Ложь;
	ОтборПостроителя["ДатаДокумента"].ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
	ПостроительОтчета.Отбор["ДатаДокумента"].Представление = "Дата документа";
	
	ОтборПостроителя.Добавить("Контрагент");
	ОтборПостроителя["Контрагент"].ВидСравнения = ВидСравнения.Равно;
	ОтборПостроителя["Контрагент"].Использование = Ложь;
	
	ОтборПостроителя.Добавить("НачалоСверки");
	ОтборПостроителя["НачалоСверки"].Использование = Ложь;
	ОтборПостроителя["НачалоСверки"].ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
	
	ОтборПостроителя.Добавить("ОкончаниеСверки");
	ОтборПостроителя["ОкончаниеСверки"].Использование = Ложь;
	ОтборПостроителя["ОкончаниеСверки"].ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
	
	ОтборПостроителя.Добавить("Менеджер");
	ОтборПостроителя["Менеджер"].ВидСравнения = ВидСравнения.Равно;
	ОтборПостроителя["Менеджер"].Использование = Ложь;
	
	ОтборПостроителя.Добавить("Согласован");
	ОтборПостроителя["Согласован"].ВидСравнения = ВидСравнения.Равно;
	ОтборПостроителя["Согласован"].Использование = Ложь;
	ОтборПостроителя["Согласован"].Значение = Истина;
	
	ОтборПостроителя.Добавить("Отправлен");
	ОтборПостроителя["Отправлен"].ВидСравнения = ВидСравнения.Равно;
	ОтборПостроителя["Отправлен"].Использование = Ложь;
	ОтборПостроителя["Отправлен"].Значение = Истина;
	
	ОтборПостроителя.Добавить("Организация");
	ОтборПостроителя["Контрагент"].ВидСравнения = ВидСравнения.Равно;
	ОтборПостроителя["Контрагент"].Использование = Ложь;	
	
КонецПроцедуры  

Процедура ВыполнитьСозданиеАктовиРазослатьСверку(ДатаН, ДатаК) Экспорт
	
	ОтправлятьПоПочте = НЕ Константы.НеОтправлятьПочту.Получить();
	Если ОтправлятьПоПочте Тогда 
		УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
		Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента,
	               |	Контрагенты.Ссылка КАК Контрагент,
	               |	ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(999)) КАК АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса
	               |ПОМЕСТИТЬ КонтрагентыВсе
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |			ПО (КонтактнаяИнформация.Объект = Контрагенты.Ссылка)
	               |				И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	               |				И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДляОтправкиАктовСверок))
	               |		ПО ДоговорыКонтрагентов.Владелец = Контрагенты.Ссылка
	               |ГДЕ
	               |	НЕ ДоговорыКонтрагентов.НеОтправлятьАктыСверкиВзаиморасчетов
	               |	И Контрагенты.ГоловнойКонтрагент = Контрагенты.Ссылка
	               |	И ДоговорыКонтрагентов.Организация = &Организация
	               |	И НЕ ДоговорыКонтрагентов.РозничнаяПродажа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АктСверкиВзаиморасчетов.Организация,
	               |	АктСверкиВзаиморасчетов.Контрагент,
	               |	АктСверкиВзаиморасчетов.ДоговорКонтрагента,
	               |	АктСверкиВзаиморасчетов.ДатаНачала,
	               |	АктСверкиВзаиморасчетов.ДатаОкончания
	               |ПОМЕСТИТЬ Акты
	               |ИЗ
	               |	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	               |ГДЕ
	               |	НЕ АктСверкиВзаиморасчетов.ПометкаУдаления
	               |	И АктСверкиВзаиморасчетов.ДатаНачала = &ДатаНач
	               |	И АктСверкиВзаиморасчетов.ДатаОкончания = &ДатаКонНачалоДня
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.ДоговорКонтрагента,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.Контрагент,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовПриход,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовРасход,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.ДоговорКонтрагента.Организация КАК Организация,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта,
	               |	КонтрагентыВсе.АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса КАК АдресЭлектроннойПочты
	               |ПОМЕСТИТЬ Взаиморасчеты
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.ОстаткиИОбороты(
	               |			&ДатаНач,
	               |			&ДатаКон,
	               |			,
	               |			,
	               |			(ДоговорКонтрагента, Контрагент) В
	               |					(ВЫБРАТЬ
	               |						КонтрагентыВсе.ДоговорКонтрагента,
	               |						КонтрагентыВсе.Контрагент
	               |					ИЗ
	               |						КонтрагентыВсе КАК КонтрагентыВсе)
	               |				И НЕ (ДоговорКонтрагента, Контрагент, Организация) В
	               |						(ВЫБРАТЬ
	               |							Акты.ДоговорКонтрагента,
	               |							Акты.Контрагент,
	               |							Акты.Организация
	               |						ИЗ
	               |							Акты КАК Акты)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты
	               |		ПОЛНОЕ СОЕДИНЕНИЕ КонтрагентыВсе КАК КонтрагентыВсе
	               |		ПО ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.Контрагент = КонтрагентыВсе.Контрагент
	               |			И ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.ДоговорКонтрагента = КонтрагентыВсе.ДоговорКонтрагента
	               |ГДЕ
	               |	(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток <> 0
	               |			ИЛИ ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток <> 0
	               |			ИЛИ ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовПриход <> 0
	               |			ИЛИ ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовРасход <> 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Взаиморасчеты.ДоговорКонтрагента,
	               |	Взаиморасчеты.Контрагент,
	               |	Взаиморасчеты.СуммаВзаиморасчетовНачальныйОстаток,
	               |	Взаиморасчеты.СуммаВзаиморасчетовКонечныйОстаток,
	               |	Взаиморасчеты.СуммаВзаиморасчетовПриход,
	               |	Взаиморасчеты.СуммаВзаиморасчетовРасход,
	               |	Взаиморасчеты.Организация,
	               |	Взаиморасчеты.Валюта,
	               |	Взаиморасчеты.АдресЭлектроннойПочты
	               |ИЗ
	               |	Взаиморасчеты КАК Взаиморасчеты
	               |ГДЕ
	               |	Взаиморасчеты.АдресЭлектроннойПочты <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Взаиморасчеты.Контрагент,
	               |	Взаиморасчеты.АдресЭлектроннойПочты
	               |ИЗ
	               |	Взаиморасчеты КАК Взаиморасчеты
	               |ГДЕ
	               |	Взаиморасчеты.АдресЭлектроннойПочты = """"";
	
	
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаН));
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаК));
	Запрос.УстановитьПараметр("ДатаКонНачалоДня",НачалоДня(ДатаК));
	Запрос.УстановитьПараметр("Организация",Константы.ОсновнаяОрганизация.Получить());

	Результат = Запрос.ВыполнитьПакет();
	КлиентыКОтправке 	= Результат[3].Выгрузить();
	
	ТабКлиентыБезАдресов   = Результат[4].Выгрузить();
	Для каждого ТекКонтргент Из ТабКлиентыБезАдресов Цикл
		НоваяСтрока = КлиентыБезАдреса.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекКонтргент);
	КонецЦикла;
	
	КоличествоАктов = КлиентыКОтправке.Количество();
	
	Если КоличествоАктов = 0 Тогда 
		ТекстСообщения = "За период с "+ДатаН+" по "+ДатаК+" нет  документов к отправке!";
		
		#Если Клиент Тогда
			Сообщить(ТекстСообщения);
		#Иначе
			ЗаписьЖурналаРегистрации("ОбработкаКонтрольИОтправкаАктовСверкиВзаиморасчетов",УровеньЖурналаРегистрации.Информация,,,ТекстСообщения);
		#КонецЕсли 
	Иначе	
		
		СоздаватьДокументы = Истина;
		
		#Если Клиент Тогда
			Если Вопрос("Внимание! Будет сформировано и отправлено "+КоличествоАктов+" документов Акт сверки взаиморасчетов. Продолжить?", РежимДиалогаВопрос.ДаНет,60) = КодВозвратаДиалога.Нет Тогда 
				СоздаватьДокументы = Ложь;
			КонецЕсли;
		#КонецЕсли 
		
		Если СоздаватьДокументы Тогда 
			НомерАкта = 0;
			Для каждого Стр Из КлиентыКОтправке Цикл
				НомерАкта = НомерАкта+1;
				
				НовыйАкт = Документы.АктСверкиВзаиморасчетов.СоздатьДокумент();
				
				НовыйАкт.Дата 				= ТекущаяДата();
				НовыйАкт.ДатаНачала 		= НачалоДня(ДатаН);
				НовыйАкт.ДатаОкончания 		= КонецДня(ДатаК);
				НовыйАкт.Организация 		= Стр.Организация;
				НовыйАкт.ВалютаДокумента 	= Стр.Валюта;
				НовыйАкт.Контрагент 		= Стр.Контрагент;
				НовыйАкт.ДоговорКонтрагента = Стр.ДоговорКонтрагента;
				НовыйАкт.Комментарий 		= "Создан автоматически обработкой контроля и отравки актов сверки взаиморасчетов";
				
				НовыйАкт.ЗаполнитьПоДаннымУправленческогоУчета(Ложь);
				ОстатокНаКонец = НовыйАкт.ОстатокНаНачало + НовыйАкт.ПоДаннымОрганизации.Итог("Дебет") -  НовыйАкт.ПоДаннымОрганизации.Итог("Кредит");
				ОстатокНаКонецКонтрагент = - НовыйАкт.ОстатокНаНачало + НовыйАкт.ПоДаннымКонтрагента.Итог("Дебет") -  НовыйАкт.ПоДаннымКонтрагента.Итог("Кредит");
				НовыйАкт.Расхождение = ОстатокНаКонец + ОстатокНаКонецКонтрагент;
				
				Попытка
					НовыйАкт.Записать(РежимЗаписиДокумента.Запись);
				Исключение
					ТекстСообщения = "Не удалось записать документ для клиента "+Стр.Контрагент+
					", договор "+Стр.ДоговорКонтрагента+
					", организация "+Стр.Организация;
					
					#Если Клиент Тогда
						Сообщить(ТекстСообщения);
					#Иначе
						ЗаписьЖурналаРегистрации("ОбработкаКонтрольИОтправкаАктовСверкиВзаиморасчетов",УровеньЖурналаРегистрации.Информация,,,ТекстСообщения);
					#КонецЕсли 
				КонецПопытки;
				
				Если НовыйАкт <> Неопределено И Стр.АдресЭлектроннойПочты <> ""  И ОтправлятьПоПочте Тогда      
					
					МСК.СоздатьИОтправитьАкт(НовыйАкт.Ссылка, Стр.Контрагент, Стр.АдресЭлектроннойПочты, КоличествоАктов,НомерАкта );
					
					//Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	#Если Клиент Тогда
		ОбновитьПостроительАктов();
	#КонецЕсли 
	
КонецПроцедуры

Функция ОбновитьПостроительАктов(ОчищатьТаблицу = Истина) Экспорт 
	
	Если ОчищатьТаблицу Тогда 
		Акты.Очистить();
	КонецЕсли;
	
	ПостроительОтчета.Выполнить();
	
	АктуальныеАкты = ПостроительОтчета.Результат.Выгрузить();
	
	Для каждого ТекущийАкт Из АктуальныеАкты Цикл
		НоваяСтрока = Акты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущийАкт);
	КонецЦикла;
	
	Возврат АктуальныеАкты.Количество();
	
КонецФункции
